Katrinajsjsnsndn/Charging_station/APM32E_Master_Node/APP/tft/LCD.c
#include "lcd.h"
#include "stdlib.h"
#include "font.h" 
#include "string.h"
#include "apm32e10x_spi.h"

// DMA传输完成标志
volatile uint8_t dma_transfer_complete = 1;

//LCD屏幕画笔颜色和背景色	   
uint16_t POINT_COLOR=0x0000;	//画笔颜色
uint16_t BACK_COLOR=0xFFFF;  //背景色 

//管理LCD重要参数
//默认为竖屏
_lcd_dev lcddev;
	 					    
//写寄存器函数
//data:寄存器值
void delay_ms(uint16_t nms)
{	 		  	  
	// 简单的延时函数，可以根据需要调整
	volatile uint32_t delay = nms * 8000;
	while (delay--);
} 
void LCD_WR_REG(uint16_t data)
{
		GPIO_ResetBit(SPI_CS_GPIO_PORT, SPI_CS_PIN);  // CS = 0
		GPIO_ResetBit(SPI_DC_GPIO_PORT, SPI_DC_PIN);  // DC = 0 (写命令)
		
		// 等待发送缓冲区空
		while(SPI_I2S_ReadStatusFlag(LCD_SPI, SPI_FLAG_TXBE) == RESET);
		// 发送数据
		SPI_I2S_TxData(LCD_SPI, data);
		// 等待发送完成
		while(SPI_I2S_ReadStatusFlag(LCD_SPI, SPI_FLAG_BSY) == SET);
		
		GPIO_SetBit(SPI_CS_GPIO_PORT, SPI_CS_PIN);  // CS = 1
}
//写数据函数
//data:寄存器值
void LCD_WR_DATA(uint16_t data)
{
		GPIO_ResetBit(SPI_CS_GPIO_PORT, SPI_CS_PIN);  // CS = 0
		GPIO_SetBit(SPI_DC_GPIO_PORT, SPI_DC_PIN);    // DC = 1 (写数据)
		
		// 等待发送缓冲区空
		while(SPI_I2S_ReadStatusFlag(LCD_SPI, SPI_FLAG_TXBE) == RESET);
		// 发送数据
		SPI_I2S_TxData(LCD_SPI, data);
		// 等待发送完成
		while(SPI_I2S_ReadStatusFlag(LCD_SPI, SPI_FLAG_BSY) == SET);
		
		GPIO_SetBit(SPI_CS_GPIO_PORT, SPI_CS_PIN);  // CS = 1
}

//写寄存器
//LCD_Reg:寄存器编号
//LCD_RegValue:要写入的数据
void LCD_WriteReg(uint16_t LCD_Reg,uint16_t LCD_RegValue)
{	
	LCD_WR_REG(LCD_Reg);  
	LCD_WriteRAM(LCD_RegValue);	    		 
}   

//开始写GRAM
void LCD_WriteRAM_Prepare(void)
{
	LCD_WR_REG(lcddev.wramcmd);
} 
//LCD写GRAM
//RGB_Code:颜色值
void LCD_WriteRAM(uint16_t RGB_Code)
{							    
	//写十六位GRAM
	GPIO_ResetBit(SPI_CS_GPIO_PORT, SPI_CS_PIN);  // CS = 0
	GPIO_SetBit(SPI_DC_GPIO_PORT, SPI_DC_PIN);    // DC = 1
	
	// 发送高8位
	while(SPI_I2S_ReadStatusFlag(LCD_SPI, SPI_FLAG_TXBE) == RESET);
	SPI_I2S_TxData(LCD_SPI, (RGB_Code >> 8) & 0xFF);
	while(SPI_I2S_ReadStatusFlag(LCD_SPI, SPI_FLAG_BSY) == SET);
	
	// 发送低8位
	while(SPI_I2S_ReadStatusFlag(LCD_SPI, SPI_FLAG_TXBE) == RESET);
	SPI_I2S_TxData(LCD_SPI, RGB_Code & 0xFF);
	while(SPI_I2S_ReadStatusFlag(LCD_SPI, SPI_FLAG_BSY) == SET);
	
	GPIO_SetBit(SPI_CS_GPIO_PORT, SPI_CS_PIN);  // CS = 1
}

//在mdk -O1时间优化时需要
//延时i
void opt_delay(uint8_t i)
{
	while(i--);
}

//LCD开启显示
void LCD_DisplayOn(void)
{					   
	LCD_WR_REG(0X29);	//开启显示
}	 
//LCD关闭显示
void LCD_DisplayOff(void)
{	   
	LCD_WR_REG(0X28);	//关闭显示
}   
//设置光标位置
//Xpos:横坐标
//Ypos:纵坐标
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{	 	    
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(Xpos>>8);LCD_WR_DATA(Xpos&0XFF); 			 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(Ypos>>8);LCD_WR_DATA(Ypos&0XFF); 		 
} 		 
   
//画点
//x,y:坐标
//POINT_COLOR:此点的颜色
void LCD_DrawPoint(uint16_t x,uint16_t y)
{
	LCD_SetCursor(x,y);		//设置光标位置 
	LCD_WriteRAM_Prepare();	//开始写入GRAM
	LCD_WriteRAM(POINT_COLOR); 
}	 
//快速画点
//x,y:坐标
//color:颜色
void LCD_Fast_DrawPoint(uint16_t x,uint16_t y,uint16_t color)
{	   
		//设置光标位置
		LCD_SetCursor(x,y); 	 
		//写入颜色
		LCD_WriteReg(lcddev.wramcmd,color);
}


//dir:方向选择 	0-0度旋转，1-180度旋转，2-270度旋转，3-90度旋转
void LCD_Display_Dir(uint8_t dir)
{
	if(dir==0||dir==1)			//竖屏
	{
			lcddev.dir=0;	//竖屏
			lcddev.width=240;
			lcddev.height=320;

			lcddev.wramcmd=0X2C;
			lcddev.setxcmd=0X2A;
			lcddev.setycmd=0X2B;
		
		if(dir==0)        //0-0度旋转
		{
			LCD_WR_REG(0x36); 
			LCD_WR_DATA((0<<3)|(0<<7)|(0<<6)|(0<<5));
		}else							//1-180度旋转
		{
			LCD_WR_REG(0x36); 
			LCD_WR_DATA((0<<3)|(1<<7)|(1<<6)|(0<<5));		
		}
		
	}else if(dir==2||dir==3)
	{
		
			lcddev.dir=1;	//横屏
			lcddev.width=320;
			lcddev.height=240;

			lcddev.wramcmd=0X2C;
			lcddev.setxcmd=0X2A;
			lcddev.setycmd=0X2B; 

				if(dir==2)				//2-270度旋转
				{
					LCD_WR_REG(0x36); 
					LCD_WR_DATA((0<<3)|(1<<7)|(0<<6)|(1<<5));

				}else							//3-90度旋转
				{
					LCD_WR_REG(0x36); 
					LCD_WR_DATA((0<<3)|(0<<7)|(1<<6)|(1<<5));
				}		
	}	


		//设置显示方向	
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(0);LCD_WR_DATA(0);
		LCD_WR_DATA((lcddev.width-1)>>8);LCD_WR_DATA((lcddev.width-1)&0XFF);
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(0);LCD_WR_DATA(0);
		LCD_WR_DATA((lcddev.height-1)>>8);LCD_WR_DATA((lcddev.height-1)&0XFF);  
	
	
}	 
//设置窗口,并自动设置画点坐标到窗口左上角(sx,sy).
//sx,sy:窗口起始坐标(左上角)
//width,height:窗口宽度和高度,必须大于0!!
//窗口大小:width*height.
void LCD_Set_Window(uint16_t sx,uint16_t sy,uint16_t width,uint16_t height)
{    
	uint16_t twidth,theight;
	twidth=sx+width-1;
	theight=sy+height-1;

		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(sx>>8); 
		LCD_WR_DATA(sx&0XFF);	 
		LCD_WR_DATA(twidth>>8); 
		LCD_WR_DATA(twidth&0XFF);  
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(sy>>8); 
		LCD_WR_DATA(sy&0XFF); 
		LCD_WR_DATA(theight>>8); 
		LCD_WR_DATA(theight&0XFF); 

}
//初始化lcd
void LCD_Init(void)
{
	// 使能GPIO和SPI时钟
	RCM_EnableAPB2PeriphClock(RCM_APB2_PERIPH_GPIOB);
	RCM_EnableAPB2PeriphClock(RCM_APB2_PERIPH_GPIOC);
	RCM_EnableAPB1PeriphClock(RCM_APB1_PERIPH_SPI2);
	
	// 配置GPIO引脚
	GPIO_Config_T gpioConfig;
	
	// 配置CS引脚为输出
	gpioConfig.pin = SPI_CS_PIN;
	gpioConfig.mode = GPIO_MODE_OUT_PP;
	gpioConfig.speed = GPIO_SPEED_50MHz;
	GPIO_Config(SPI_CS_GPIO_PORT, &gpioConfig);
	
	// 配置DC引脚为输出
	gpioConfig.pin = SPI_DC_PIN;
	GPIO_Config(SPI_DC_GPIO_PORT, &gpioConfig);
	
	// 配置RST引脚为输出
	gpioConfig.pin = SPI_RST_PIN;
	GPIO_Config(SPI_RST_GPIO_PORT, &gpioConfig);
	
	// 配置背光引脚为输出
	gpioConfig.pin = LCD_LED_PIN;
	GPIO_Config(LCD_LED_GPIO_PORT, &gpioConfig);
	
	// 配置SPI2引脚为复用功能 - 最大速度
	// MOSI (PB15)
	gpioConfig.pin = SPI_SDI_PIN;
	gpioConfig.mode = GPIO_MODE_AF_PP;
	gpioConfig.speed = GPIO_SPEED_50MHz;  // 最大GPIO速度
	GPIO_Config(SPI_SDI_GPIO_PORT, &gpioConfig);
	
	// SCK (PB13)
	gpioConfig.pin = SPI_SCK_PIN;
	gpioConfig.speed = GPIO_SPEED_50MHz;  // 最大GPIO速度
	GPIO_Config(SPI_SCK_GPIO_PORT, &gpioConfig);
	
	// MISO (PB14) - 如果需要读取数据
	gpioConfig.pin = SPI_SDO_PIN;
	gpioConfig.mode = GPIO_MODE_IN_FLOATING;
	GPIO_Config(SPI_SDO_GPIO_PORT, &gpioConfig);
	
	// 初始化引脚状态
	GPIO_SetBit(SPI_CS_GPIO_PORT, SPI_CS_PIN);  // CS高电平
	GPIO_SetBit(SPI_DC_GPIO_PORT, SPI_DC_PIN);  // DC高电平
	GPIO_SetBit(SPI_RST_GPIO_PORT, SPI_RST_PIN); // RST高电平
	GPIO_SetBit(LCD_LED_GPIO_PORT, LCD_LED_PIN); // 背光开启
	
	// 配置SPI2 - 稳定速度
	SPI_Config_T spiConfig;
	SPI_ConfigStructInit(&spiConfig);
	spiConfig.mode = SPI_MODE_MASTER;
	spiConfig.direction = SPI_DIRECTION_2LINES_FULLDUPLEX;
	spiConfig.length = SPI_DATA_LENGTH_8B;
	spiConfig.polarity = SPI_CLKPOL_LOW;
	spiConfig.phase = SPI_CLKPHA_1EDGE;
	spiConfig.nss = SPI_NSS_SOFT;
	spiConfig.baudrateDiv = SPI_BAUDRATE_DIV_4;  // 稳定速度：4分频
	spiConfig.firstBit = SPI_FIRSTBIT_MSB;
	SPI_Config(LCD_SPI, &spiConfig);
	
	// 使能SPI2
	SPI_Enable(LCD_SPI);
	
	// 初始化DMA
	LCD_DMA_Init();
	
	// LCD复位序列
	GPIO_SetBit(SPI_RST_GPIO_PORT, SPI_RST_PIN);
	delay_ms(1);
	GPIO_ResetBit(SPI_RST_GPIO_PORT, SPI_RST_PIN);
	delay_ms(10);
	GPIO_SetBit(SPI_RST_GPIO_PORT, SPI_RST_PIN);
	delay_ms(120);  

