Katrinajsjsnsndn/Charging_station/APM32E_Master_Node/APP/tft/LCD.c
    return data;
}
uint16_t id_order=0x04;
uint32_t LCD_Read_ID(void)
{
    uint8_t id[3];
    uint32_t id32;

    LCD_WR_REG(0x04);
    GPIO_ResetBit(SPI_CS_GPIO_PORT, SPI_CS_PIN);  // CS = 0

    /* 进入数据阶段（DC = 1），连续读 3 字节 */
    GPIO_SetBit(SPI_DC_GPIO_PORT, SPI_DC_PIN);    // DC = 1 数据

    id[0] = spi_read_byte();   /* dummy 0x00 */
    id[1] = spi_read_byte();   /* manufacturer ID，通常是 0x85 */
    id[2] = spi_read_byte();   /* version/driver ID */

    GPIO_SetBit(SPI_CS_GPIO_PORT, SPI_CS_PIN);    // CS = 1

    id32 = ((uint32_t)id[0] << 16) | ((uint32_t)id[1] << 8) | id[2];
    return id32;
}

// 动态调整SPI速度
void LCD_Set_SPI_Speed(SPI_BAUDRATE_DIV_T speed)
{
    // 禁用SPI
    SPI_Disable(LCD_SPI);
    
    // 重新配置SPI速度
    SPI_Config_T spiConfig;
    SPI_ConfigStructInit(&spiConfig);
    spiConfig.mode = SPI_MODE_MASTER;
    spiConfig.direction = SPI_DIRECTION_2LINES_FULLDUPLEX;
    spiConfig.length = SPI_DATA_LENGTH_8B;
    spiConfig.polarity = SPI_CLKPOL_LOW;
    spiConfig.phase = SPI_CLKPHA_1EDGE;
    spiConfig.nss = SPI_NSS_SOFT;
    spiConfig.baudrateDiv = speed;  // 新的速度设置
    spiConfig.firstBit = SPI_FIRSTBIT_MSB;
    SPI_Config(LCD_SPI, &spiConfig);
    
    // 重新使能SPI
    SPI_Enable(LCD_SPI);
}

//DMA初始化
void LCD_DMA_Init(void)
{
    // 使能DMA1时钟
    RCM_EnableAHBPeriphClock(RCM_AHB_PERIPH_DMA1);
    
    // 配置DMA通道
    DMA_Config_T dmaConfig;
    DMA_ConfigStructInit(&dmaConfig);
    
    dmaConfig.peripheralBaseAddr = (uint32_t)&LCD_SPI->DATA;  // SPI2数据寄存器地址
    dmaConfig.memoryBaseAddr = 0;  // 将在传输时设置
    dmaConfig.dir = DMA_DIR_PERIPHERAL_DST;  // 内存到外设
    dmaConfig.bufferSize = 0;  // 将在传输时设置
    dmaConfig.peripheralInc = DMA_PERIPHERAL_INC_DISABLE;  // 外设地址不递增
    dmaConfig.memoryInc = DMA_MEMORY_INC_ENABLE;  // 内存地址递增
    dmaConfig.peripheralDataSize = DMA_PERIPHERAL_DATA_SIZE_BYTE;  // 外设数据宽度8位
    dmaConfig.memoryDataSize = DMA_MEMORY_DATA_SIZE_BYTE;  // 内存数据宽度8位
    dmaConfig.loopMode = DMA_MODE_NORMAL;  // 正常模式
    dmaConfig.priority = DMA_PRIORITY_HIGH;  // 高优先级
    dmaConfig.M2M = DMA_M2MEN_DISABLE;  // 非内存到内存模式
    
    DMA_Config(LCD_DMA_TX_CHANNEL, &dmaConfig);
    
    // 使能DMA传输完成中断
    DMA_EnableInterrupt(LCD_DMA_TX_CHANNEL, DMA_INT_TC);
    
    // 配置NVIC
    NVIC_EnableIRQRequest(LCD_DMA_TX_IRQn, 2, 0);
    
    // 使能SPI2的DMA发送请求
    SPI_I2S_EnableDMA(LCD_SPI, SPI_I2S_DMA_REQ_TX);
}

//DMA等待传输完成
void LCD_DMA_WaitComplete(void)
{
    while(!dma_transfer_complete)
    {
        // 等待DMA传输完成
    }
}

//DMA发送数据
void LCD_DMA_WriteData(uint16_t *data, uint32_t size)
{
	// 等待上一次传输完成
	LCD_DMA_WaitComplete();
	
	// 设置传输参数
	LCD_DMA_TX_CHANNEL->CHMADDR = (uint32_t)data;  // 设置内存地址
	LCD_DMA_TX_CHANNEL->CHNDATA = size;  // 设置传输数量（字节数）
	
	// 清除传输完成标志
	dma_transfer_complete = 0;
	
	// 清除DMA标志
	DMA_ClearStatusFlag(LCD_DMA_TX_FLAG);
	
	// 使能DMA通道
	DMA_Enable(LCD_DMA_TX_CHANNEL);
}

//DMA中断处理函数
void DMA1_Channel5_IRQHandler(void)
{
    if(DMA_ReadStatusFlag(LCD_DMA_TX_FLAG) != RESET)
    {
        // 清除中断标志
        DMA_ClearStatusFlag(LCD_DMA_TX_FLAG);
        
        // 禁用DMA通道
        DMA_Disable(LCD_DMA_TX_CHANNEL);
        
        // 设置传输完成标志
        dma_transfer_complete = 1;
    }
}